Revit 2026 API

# MEPAnalyticalNode Class

---

Represents an analytical node of the MEP analytical model.

SystemObject Autodesk.Revit.DB.AnalysisMEPAnalyticalNode

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MEPAnalyticalNode : IDisposable
```
```vb
Public Class MEPAnalyticalNode
	Implements IDisposable
```
```cpp
public ref class MEPAnalyticalNode : IDisposable
```
```fsharp
type MEPAnalyticalNode =
    class
        interface IDisposable
    end
```

The MEPAnalyticalNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Id | The identity used in the MEPAnalyticalSegment |
|  | IsFlowBlocked | Is the flow blocked at this analytical node? |
|  | IsFocalNode | Is this node a focal point of multiple branches? |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Location | The location of this node. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the MEPAnalyticalNode |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsSameNode | Verify if this node is connected to the other node and thus represents the same analytical node in the network. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Analysis Namespace